# Topic: Data Manupulation - with pandas.

## Pandas - Dataframe

In [3]:
import numpy as np
import pandas as pd

### Data frame is 2 dimensional !!

In [4]:
emps = {'name': ['Alice', 'Bob', 'Charlie', 'David'],
        'age': [25, 30, 35, 40],
        'department': ['HR', 'Finance', 'IT', 'Marketing'],
        'salary': [50000, 60000, 70000, 80000],
        'city': ['New York', 'Los Angeles', 'Chicago', 'Houston']}

In [5]:
pd.DataFrame(emps)

      name  age department  salary         city
0    Alice   25         HR   50000     New York
1      Bob   30    Finance   60000  Los Angeles
2  Charlie   35         IT   70000      Chicago
3    David   40  Marketing   80000      Houston

- Here the row numbers = O,1,2,3... are called as "Index", individuall called as "Index numbers".
- Index will be always on the left side.
- the Name, age,.. called as "Column names".
- Column can also be reffered with index numbers.

### Reading the External files (CSV, Json, Xsls etc.,) with read functions

- pd.read_csv
- pd.read_excel
- pd.read_sql_table
- pd.read-hdf
etc., 
- you can read them from internet "python read functions"
- when ever you read any data file in python, it takes as DATA FRAME.

In [6]:
pd.read_csv("data/movies.csv")

     Rank                         Title           Studio       Gross  Year
0       1             Avengers: Endgame      Buena Vista  $2,796.30   2019
1       2                        Avatar              Fox  $2,789.70   2009
2       3                       Titanic        Paramount  $2,187.50   1997
3       4  Star Wars: The Force Awakens      Buena Vista  $2,068.20   2015
4       5        Avengers: Infinity War      Buena Vista  $2,048.40   2018
..    ...                           ...              ...         ...   ...
777   778                     Yogi Bear  Warner Brothers    $201.60   2010
778   779           Garfield: The Movie              Fox    $200.80   2004
779   780                   Cats & Dogs  Warner Brothers    $200.70   2001
780   781      The Hunt for Red October        Paramount    $200.50   1990
781   782                      Valkyrie              MGM    $200.30   2008

[782 rows x 5 columns]

### To check the Data type of column:

In [7]:
pd.read_csv("data/movies.csv").dtypes

Rank       int64
Title     object
Studio    object
Gross     object
Year       int64
dtype: object

### To change the a column into index:
- Here Title column is moved in the place of Index numbers.
- Moving of a column into index position, does not means the Index numbers 0,1,2,3, are replaced. they are still there, but we can not see them.

In [8]:
movies = pd.read_csv("data/movies.csv", index_col="Title")
movies

                              Rank           Studio       Gross  Year
Title
Avengers: Endgame                1      Buena Vista  $2,796.30   2019
Avatar                           2              Fox  $2,789.70   2009
Titanic                          3        Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4      Buena Vista  $2,068.20   2015
Avengers: Infinity War           5      Buena Vista  $2,048.40   2018
...                            ...              ...         ...   ...
Yogi Bear                      778  Warner Brothers    $201.60   2010
Garfield: The Movie            779              Fox    $200.80   2004
Cats & Dogs                    780  Warner Brothers    $200.70   2001
The Hunt for Red October       781        Paramount    $200.50   1990
Valkyrie                       782              MGM    $200.30   2008

[782 rows x 4 columns]

### Using Head and Tail Methods, to get first (n) number of data, and Last (n) number of Data:

In [9]:
movies.head(10)    #Top 10 rows.

                              Rank       Studio       Gross  Year
Title
Avengers: Endgame                1  Buena Vista  $2,796.30   2019
Avatar                           2          Fox  $2,789.70   2009
Titanic                          3    Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4  Buena Vista  $2,068.20   2015
Avengers: Infinity War           5  Buena Vista  $2,048.40   2018
Jurassic World                   6    Universal  $1,671.70   2015
Marvel's The Avengers            7  Buena Vista  $1,518.80   2012
Furious 7                        8    Universal  $1,516.00   2015
Avengers: Age of Ultron          9  Buena Vista  $1,405.40   2015
Black Panther                   10  Buena Vista  $1,346.90   2018

In [10]:
movies.tail(5)    #Last 5 rows.

                          Rank           Studio     Gross  Year
Title
Yogi Bear                  778  Warner Brothers  $201.60   2010
Garfield: The Movie        779              Fox  $200.80   2004
Cats & Dogs                780  Warner Brothers  $200.70   2001
The Hunt for Red October   781        Paramount  $200.50   1990
Valkyrie                   782              MGM  $200.30   2008

### Index location operator:

In [ ]:
movies.iloc[0]  

# First row of the DataFrame

Rank                1
Studio    Buena Vista
Gross      $2,796.30
Year             2019
Name: Avengers: Endgame, dtype: object

In [ ]:
movies.iloc[5]  

# Sixth row of the DataFrame

Rank               6
Studio     Universal
Gross     $1,671.70
Year            2015
Name: Jurassic World, dtype: object

### Index with the Title (names):

In [ ]:
movies.loc["Valkyrie"]  

# Row with index label 'valkyrie'

Rank           782
Studio         MGM
Gross     $200.30
Year          2008
Name: Valkyrie, dtype: object

In [ ]:
movies.loc["Avatar"]  

# Row with index label 'Avatar'

Rank               2
Studio           Fox
Gross     $2,789.70
Year            2009
Name: Avatar, dtype: object

### Index Location with Range:

In [ ]:
movies.iloc[1:4]   

# Rows from index 1 to 3 (4 is exclusive)

                              Rank       Studio       Gross  Year
Title
Avatar                           2          Fox  $2,789.70   2009
Titanic                          3    Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4  Buena Vista  $2,068.20   2015

In [ ]:
movies.iloc[34:45]

# Rows from index 34 to 44 (45 is exclusive)

,Rank,Studio,Gross,Year
Title,,,,
Star Wars: Episode I - The Phantom Menace,35,Fox,"$1,027.00",1999
Alice in Wonderland,36,Buena Vista,"$1,025.50",2010
Zootopia,37,Buena Vista,"$1,023.80",2016
The Hobbit: An Unexpected Journey,38,Warner Brothers,"$1,021.10",2012
The Dark Knight,39,Warner Brothers,"$1,004.90",2008
Harry Potter and the Sorcerer's Stone,40,Warner Brothers,$975.10,2001
Despicable Me 2,41,Universal,$970.80,2013
The Lion King,42,Buena Vista,$968.50,1994
The Jungle Book,43,Buena Vista,$966.60,2016
Pirates of the Caribbean: At World's End,44,Buena Vista,$963.40,2007
Jumanji: Welcome to the Jungle,45,Sony,$962.10,2017

In [17]:
type(movies)

pandas.core.frame.DataFrame

In [18]:
type(movies["Gross"])

pandas.core.series.Series

In [ ]:
 movies["Studio"]
 
 # it will show with the index (Title)

Title
Avengers: Endgame                   Buena Vista
Avatar                                      Fox
Titanic                               Paramount
Star Wars: The Force Awakens        Buena Vista
Avengers: Infinity War              Buena Vista
                                     ...
Yogi Bear                       Warner Brothers
Garfield: The Movie                         Fox
Cats & Dogs                     Warner Brothers
The Hunt for Red October              Paramount
Valkyrie                                    MGM
Name: Studio, Length: 782, dtype: object

In [ ]:
movies[["Studio","Gross"]] 

# Multiple columns with index (Title)

                                       Studio       Gross
Title
Avengers: Endgame                 Buena Vista  $2,796.30
Avatar                                    Fox  $2,789.70
Titanic                             Paramount  $2,187.50
Star Wars: The Force Awakens      Buena Vista  $2,068.20
Avengers: Infinity War            Buena Vista  $2,048.40
...                                       ...         ...
Yogi Bear                     Warner Brothers    $201.60
Garfield: The Movie                       Fox    $200.80
Cats & Dogs                   Warner Brothers    $200.70
The Hunt for Red October            Paramount    $200.50
Valkyrie                                  MGM    $200.30

[782 rows x 2 columns]

In [ ]:
type(movies[["Studio","Gross"]])  

#type of the multiple columns selection

pandas.core.frame.DataFrame

## Let's Focus of "Gross" column:

In [ ]:
movies.Gross.dtype   

# 'O' means Object.

dtype('O')

In [ ]:
movies.Gross.head(3)  

#since there is $ sign it became object type instead of numeric type.

Title
Avengers: Endgame    $2,796.30
Avatar               $2,789.70
Titanic              $2,187.50
Name: Gross, dtype: object

In [24]:
# now we will convert it to float type by removing $ sign and commas

In [25]:
movies["Gross"].str  #string functions

In [26]:
movies["Gross"].str.replace("$","").str.replace(",","")

Title
Avengers: Endgame               2796.30
Avatar                          2789.70
Titanic                         2187.50
Star Wars: The Force Awakens    2068.20
Avengers: Infinity War          2048.40
                                  ...
Yogi Bear                        201.60
Garfield: The Movie              200.80
Cats & Dogs                      200.70
The Hunt for Red October         200.50
Valkyrie                         200.30
Name: Gross, Length: 782, dtype: object

### We have replaced the $ and comma(,) with empty, still it is Object DType.  so we need to convert its Data type to Float

In [27]:
# for that we will use astype() function to convert the Data type to float

In [28]:
movies["Gross"].str.replace("$","").str.replace(",","").astype(float)

Title
Avengers: Endgame               2796.3
Avatar                          2789.7
Titanic                         2187.5
Star Wars: The Force Awakens    2068.2
Avengers: Infinity War          2048.4
                                 ...
Yogi Bear                        201.6
Garfield: The Movie              200.8
Cats & Dogs                      200.7
The Hunt for Red October         200.5
Valkyrie                         200.3
Name: Gross, Length: 782, dtype: float64

### It is just a reference, to make the changes permanent we need to assign it back to the Gross column

In [ ]:
movies["Gross"] 

#it is still object type because we didn't assign the converted values back to the DataFrame.

Title
Avengers: Endgame               $2,796.30
Avatar                          $2,789.70
Titanic                         $2,187.50
Star Wars: The Force Awakens    $2,068.20
Avengers: Infinity War          $2,048.40
                                   ...
Yogi Bear                         $201.60
Garfield: The Movie               $200.80
Cats & Dogs                       $200.70
The Hunt for Red October          $200.50
Valkyrie                          $200.30
Name: Gross, Length: 782, dtype: object

In [ ]:
movies["Gross"] = (
    movies["Gross"]
    .str.replace("$", "")
    .str.replace(",", "")
    .astype(float)
)

# we assigned the converted values back to the DataFrame.

In [ ]:
movies["Gross"]   

# now it is float type

Title
Avengers: Endgame               2796.3
Avatar                          2789.7
Titanic                         2187.5
Star Wars: The Force Awakens    2068.2
Avengers: Infinity War          2048.4
                                 ...
Yogi Bear                        201.6
Garfield: The Movie              200.8
Cats & Dogs                      200.7
The Hunt for Red October         200.5
Valkyrie                         200.3
Name: Gross, Length: 782, dtype: float64

### Reading the Other Data Set : nba.csv

In [43]:
nba = pd.read_csv("data/nba.csv",parse_dates=["Birthday"])

/var/folders/68/pk2ryt213gq2t0y7rqv8f9_h0000gn/T/ipykernel_11227/262166902.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  nba = pd.read_csv("data/nba.csv",parse_dates=["Birthday"])

In [45]:
nba.head()

             Name                Team Position   Birthday   Salary
0    Shake Milton  Philadelphia 76ers       SG 1996-09-26  1445697
1  Christian Wood     Detroit Pistons       PF 1995-09-27  1645357
2   PJ Washington   Charlotte Hornets       PF 1998-08-23  3831840
3    Derrick Rose     Detroit Pistons       PG 1988-10-04  7317074
4   Marial Shayok  Philadelphia 76ers        G 1995-07-26    79568

In [47]:
nba.dtypes

Name                object
Team                object
Position            object
Birthday    datetime64[ns]
Salary               int64
dtype: object

In [48]:
#we have converted the Birthday column to datetime type while reading the csv file by using parse_dates parameter.

In [49]:
# we can also use other attributes while reading the csv file, check from internet.

### working back on movies data set again:

In [52]:
movies.head()

                              Rank       Studio   Gross  Year
Title
Avengers: Endgame                1  Buena Vista  2796.3  2019
Avatar                           2          Fox  2789.7  2009
Titanic                          3    Paramount  2187.5  1997
Star Wars: The Force Awakens     4  Buena Vista  2068.2  2015
Avengers: Infinity War           5  Buena Vista  2048.4  2018

### sorting the columns.

In [ ]:
movies.sort_values(by="Year")  

# by default it sorts by ascending order

                                   Rank           Studio   Gross  Year
Title
Gone with the Wind                  288              MGM   402.4  1939
Bambi                               540              RKO   267.4  1942
101 Dalmatians                      708      Buena Vista   215.9  1961
The Jungle Book                     755      Buena Vista   205.8  1967
The Godfather                       604        Paramount   245.1  1972
...                                 ...              ...     ...   ...
Men in Black International          686             Sony   220.8  2019
John Wick: Chapter 3 - Parabellum   458        Lionsgate   304.7  2019
Pokemon Detective Pikachu           263  Warner Brothers   427.5  2019
Dark Phoenix                        603              Fox   245.1  2019
Avengers: Endgame                     1      Buena Vista  2796.3  2019

[782 rows x 4 columns]

#### Sorting the columns by Multiple columns.

In [59]:
movies.sort_values(by = ["Studio", "Year"])  

# sorting by multiple columns, here position of ordering is important. 
# first Studio will be sorted, and with respected to studio ,year will be sorted.

                         Rank       Studio  Gross  Year
Title
The Blair Witch Project   588      Artisan  248.6  1999
101 Dalmatians            708  Buena Vista  215.9  1961
The Jungle Book           755  Buena Vista  205.8  1967
Who Framed Roger Rabbit   410  Buena Vista  329.8  1988
Dead Poets Society        636  Buena Vista  235.9  1989
...                       ...          ...    ...   ...
The King's Speech         276    Weinstein  414.2  2010
The Intouchables          265    Weinstein  426.6  2012
Django Unchained          266    Weinstein  425.4  2012
Silver Linings Playbook   631    Weinstein  236.4  2012
The Imitation Game        642    Weinstein  233.6  2014

[782 rows x 4 columns]

#### if wanted descending order we can use ascending = False parameter.

In [64]:
movies.sort_values(by = ["Studio", "Year"], ascending= [False, True])

# Studio will be Descending order, (asc = false)
# Year will be Ascending order, (asc = True)

                         Rank       Studio   Gross  Year
Title
Inglourious Basterds      424    Weinstein   321.5  2009
The King's Speech         276    Weinstein   414.2  2010
The Intouchables          265    Weinstein   426.6  2012
Django Unchained          266    Weinstein   425.4  2012
Silver Linings Playbook   631    Weinstein   236.4  2012
...                       ...          ...     ...   ...
Captain Marvel             22  Buena Vista  1128.3  2019
Aladdin                    59  Buena Vista   880.2  2019
Toy Story 4               198  Buena Vista   519.8  2019
Dumbo                     369  Buena Vista   351.8  2019
The Blair Witch Project   588      Artisan   248.6  1999

[782 rows x 4 columns]

### count the total movies produced by each studio

In [68]:
movie_count = movies["Studio"].value_counts()

movie_count

Studio
Warner Brothers           132
Buena Vista               125
Fox                       117
Universal                 109
Sony                       86
Paramount                  76
Dreamworks                 27
Lionsgate                  21
New Line                   16
MGM                        11
TriStar                    11
Miramax                    10
Weinstein                   6
Columbia                    5
WGUSA                       4
Polygram                    2
Orion                       2
SonR                        2
Dimension                   2
Vestron                     1
USA                         1
Lions                       1
Focus                       1
Rela.                       1
CL                          1
Pathe                       1
Artisan                     1
IFC                         1
GrtIndia                    1
RKO                         1
UTV                         1
FUN                         1
FR                          1
Newmarket                   1
China Film Corporation      1
HC                          1
Magn.                       1
Name: count, dtype: int64